Repository: AbdhulFathir/FYP_W1903051
Catalog: built_*_localization/lib/l10n/app_*.arb
Languages: si, ta

# appTitle
source: Localization Research Project
si: ස්ථානීකරණ පර්යේෂණ ව්‍යාපෘතිය
ta: மொழியாக்க ஆராய்ச்சி திட்டம்

# welcomeTitle
source: Welcome to Localization Research
si: ස්ථානීකරණ පර්යේෂණයට සාදරයෙන් පිළිගනිමු
ta: மொழியாக்க ஆராய்ச்சிக்கு வரவேற்கிறோம்

# version
source: Version {version}
si: අනුවාදය {version}
ta: பதிப்பு {version}

# welcomeDescription
source: This application demonstrates built-in Flutter localization using gen-l10n and ARB files. Explore different screens to experience multilingual support in action.
si: මෙම යෙදුම gen-l10n සහ ARB ගොනු භාවිතා කරමින් Flutter හි ස්ථානීකරණය පෙන්වයි. බහුභාෂා සහාය ක්‍රියාත්මක කිරීමට විවිධ තිර ගවේෂණය කරන්න.
ta: இந்த பயன்பாடு gen-l10n மற்றும் ARB கோப்புகளைப் பயன்படுத்தி Flutter இன் உள்ளமைக்கப்பட்ட மொழியாக்கத்தை நிரூபிக்கிறது. பல மொழி ஆதரவை செயல்படுத்த பல்வேறு திரைகளை ஆராயுங்கள்.

source: Quick Navigation
si: ක්ෂණික සංචලනය
ta: விரைவு வழிசெலுத்தல்

source: Items List
si: අයිතම ලැයිස්තුව
ta: பொருட்கள் பட்டியல்

# browseCollection
source: Browse through our collection
si: අපගේ එකතුව හරහා සැරිසරන්න
ta: எங்கள் சேகரிப்பு மூலம் உலாவுங்கள்

source: Settings
si: සැකසීම්
ta: அமைப்புகள்

# customizeExperience
source: Customize your experience
si: ඔබගේ අත්දැකීම අභිරුචිකරණය කරන්න
ta: உங்கள் அனுபவத்தை தனிப்பயனாக்குங்கள்

source: About
si: පිළිබඳව
ta: பற்றி

# learnMore
source: Learn more about the app
si: යෙදුම ගැන තව දැනගන්න
ta: பயன்பாட்டைப் பற்றி மேலும் அறிக

source: Languages
si: භාෂා
ta: மொழிகள்

source: Screens
si: තිර
ta: திரைகள்

source: Items
si: අයිතම
ta: பொருட்கள்

source: Product Catalog
si: නිෂ්පාදන නාමාවලිය
ta: தயாரிப்பு பட்டியல்

# itemsAvailable
source: {count} items available
si: {count} අයිතම ලබා ගත හැක
ta: {count} பொருட்கள் கிடைக்கின்றன

# tapItemInfo
source: Tap on any item to view detailed information, specifications, and related products.
si: විස්තර, පිරිවිතර සහ අදාළ නිෂ්පාදන බැලීමට ඕනෑම අයිතමයක් මත තට්ටු කරන්න.
ta: விரிவான தகவல், விவரக்குறிப்புகள் மற்றும் தொடர்புடைய தயாரிப்புகளைப் பார்க்க எந்தப் பொருளையும் தட்டவும்.

source: Load More Items
si: තවත් අයිතම පූරණය කරන්න
ta: மேலும் பொருட்களை ஏற்றவும்

source: Available
si: ලබා ගත හැක
ta: கிடைக்கிறது

source: Limited Stock
si: සීමිත ගබඩාව
ta: வரையறுக்கப்பட்ட பங்கு

source: New Arrival
si: නව පැමිණීම
ta: புதிய வருகை

source: Best Seller
si: හොඳම විකුණුම්කරු
ta: சிறந்த விற்பனையாளர்

# reviewsCount
source: {count} reviews
si: {count} සමාලෝචන
ta: {count} மதிப்பீடுகள்

source: Description
si: විස්තරය
ta: விளக்கம்

source: Specifications
si: පිරිවිතර
ta: விவரக்குறிப்புகள்

source: Product ID
si: නිෂ්පාදන හැඳුනුම්පත
ta: தயாரிப்பு அடையாளம்

source: Category
si: වර්ගය
ta: வகை

source: Status
si: තත්වය
ta: நிலை

source: Price
si: මිල
ta: விலை

source: Rating
si: ශ්‍රේණිගත කිරීම
ta: மதிப்பீடு

# reviewsLabel
source: Reviews
si: සමාලෝචන
ta: மதிப்பீடுகள்

# customerReviews
source: {count} customer reviews
si: {count} ගැඹුරු සමාලෝචන
ta: {count} வாடிக்கையாளர் மதிப்பீடுகள்

source: Tags
si: ටැග්
ta: குறிச்சொற்கள்

source: Related Products
si: අදාළ නිෂ්පාදන
ta: தொடர்புடைய தயாரிப்புகள்

source: Add to Favorites
si: ප්‍රියතම එකතුවට එක් කරන්න
ta: விருப்பங்களில் சேர்க்க

source: Added to favorites
si: ප්‍රියතම එකතුවට එක් කරන ලදී
ta: விருப்பங்களில் சேர்க்கப்பட்டது

source: Add to Cart
si: කරත්තයට එක් කරන්න
ta: கார்ட்டில் சேர்க்க

# addedToCart
source: Added to cart successfully
si: කරත්තයට සාර්ථකව එක් කරන ලදී
ta: கார்ட்டில் வெற்றிகரமாக சேர்க்கப்பட்டது

# customizeAppExperience
source: Customize your app experience
si: ඔබගේ යෙදුමේ අත්දැකීම අභිරුචිකරණය කරන්න
ta: உங்கள் பயன்பாட்டின் அனுபவத்தை தனிப்பயனாக்குங்கள்

# configurePreferences
source: Configure your application preferences. Change language, adjust display settings, manage notifications, and customize your experience.
si: ඔබගේ යෙදුමේ මනාප සැකසීම. භාෂාව වෙනස් කරන්න, දර්ශන සැකසීම් සකස් කරන්න, දැනුම්දීම් කළමනාකරණය කරන්න සහ ඔබගේ අත්දැකීම අභිරුචිකරණය කරන්න.
ta: உங்கள் பயன்பாட்டு விருப்பத்தேர்வுகளை கட்டமைக்கவும். மொழியை மாற்றவும், காட்சி அமைப்புகளை சரிசெய்யவும், அறிவிப்புகளை நிர்வகிக்கவும் மற்றும் உங்கள் அனுபவத்தை தனிப்பயனாக்கவும்.

source: Language Settings
si: භාෂා සැකසීම්
ta: மொழி அமைப்புகள்

source: Select Language
si: භාෂාව තෝරන්න
ta: மொழியைத் தேர்ந்தெடுக்கவும்

source: English
si: ඉංග්‍රීසි
ta: ஆங்கிலம்

# tamil
source: தமிழ்
si: දමිළ

source: Display Settings
si: දර්ශන සැකසීම්
ta: காட்சி அமைப்புகள்

source: Theme Mode
si: තේමා ප්‍රකාරය
ta: தீம் பயன்முறை

source: Light Mode
si: ආලෝක ප්‍රකාරය
ta: வெளிச்ச பயன்முறை

source: Dark Mode
si: අඳුරු ප්‍රකාරය
ta: இருள் பயன்முறை

source: System Default
si: පද්ධති පෙරනිමිය
ta: கணினி இயல்புநிலை

source: Notifications
si: දැනුම්දීම්
ta: அறிவிப்புகள்

source: Enable Notifications
si: දැනුම්දීම් සක්‍රිය කරන්න
ta: அறிவிப்புகளை இயக்கவும்

# notificationsDescription
source: Receive updates about new features, important announcements, and personalized content recommendations.
si: නව විශේෂාංග, වැදගත් නිවේදන සහ පුද්ගලීකෘත අන්තර්ගත නිර්දේශ පිළිබඳ යාවත්කාලීන කිරීම් ලබා ගන්න.
ta: புதிய அம்சங்கள், முக்கியமான அறிவிப்புகள் மற்றும் தனிப்பயனாக்கப்பட்ட உள்ளடக்க பரிந்துரைகள் பற்றிய புதுப்பிப்புகளைப் பெறுங்கள்.

source: Security
si: ආරක්ෂාව
ta: பாதுகாப்பு

source: Biometric Authentication
si: ජීවමිතික සත්‍යාපනය
ta: உயிரியல் அங்கீகாரம்

# biometricDescription
source: Use fingerprint or face recognition to secure your app.
si: ඔබගේ යෙදුම ආරක්ෂා කිරීමට ඇඟිලි සටහන හෝ මුහුණ හඳුනාගැනීම භාවිතා කරන්න.
ta: உங்கள் பயன்பாட்டைப் பாதுகாக்க விரல் அச்சு அல்லது முக அங்கீகாரத்தைப் பயன்படுத்தவும்.

source: Data & Sync
si: දත්ත සහ සමමුහුර්ත කිරීම
ta: தரவு மற்றும் ஒத்திசைவு

source: Auto Sync
si: ස්වයංක්‍රීය සමමුහුර්ත කිරීම
ta: தானியங்கி ஒத்திசைவு

# autoSyncDescription
source: Automatically sync your data across all devices.
si: සියලුම උපාංග හරහා ඔබගේ දත්ත ස්වයංක්‍රීයව සමමුහුර්ත කරන්න.
ta: எல்லா சாதனங்களிலும் உங்கள் தரவை தானாக ஒத்திசைக்கவும்.

source: Save Settings
si: සැකසීම් සුරකින්න
ta: அமைப்புகளைச் சேமிக்கவும்

# settingsSaved
source: Settings saved successfully
si: සැකසීම් සාර්ථකව සුරකින ලදී
ta: அமைப்புகள் வெற்றிகரமாக சேமிக்கப்பட்டன

source: Overview
si: දළ විශ්ලේෂණය
ta: கண்ணோட்டம்

# aboutDescription
source: This application is part of a comprehensive research project comparing different localization methods in Flutter. This prototype demonstrates Flutter's built-in localization system using gen-l10n and ARB files. The application supports multiple languages and showcases best practices for internationalization in modern mobile applications.
si: මෙම යෙදුම Flutter හි විවිධ ස්ථානීකරණ ක්‍රම සංසන්දනය කරන සවිස්තරාත්මක පර්යේෂණ ව්‍යාපෘතියක කොටසකි. මෙම ප්‍රෝටෝටයිප් gen-l10n සහ ARB ගොනු භාවිතා කරමින් Flutter හි ස්ථානීකරණ පද්ධතිය පෙන්වයි. යෙදුම බහු භාෂා සහාය දක්වන අතර නවීන ජංගම යෙදුම්වල ජාත්‍යන්තරකරණය සඳහා හොඳම පිළිවෙත් පෙන්වයි.
ta: இந்த பயன்பாடு Flutter இல் வெவ்வேறு மொழியாக்க முறைகளை ஒப்பிடும் விரிவான ஆராய்ச்சி திட்டத்தின் ஒரு பகுதியாகும். இந்த முன்மாதிரி gen-l10n மற்றும் ARB கோப்புகளைப் பயன்படுத்தி Flutter இன் உள்ளமைக்கப்பட்ட மொழியாக்க அமைப்பை நிரூபிக்கிறது. பயன்பாடு பல மொழிகளை ஆதரிக்கிறது மற்றும் நவீன மொபைல் பயன்பாடுகளில் சர்வதேசமயமாக்கத்திற்கான சிறந்த நடைமுறைகளை வழங்குகிறது.

source: Technical Details
si: තාක්ෂණික විස්තර
ta: தொழில்நுட்ப விவரங்கள்

source: Technology Stack
si: තාක්ෂණික ස්ථාකය
ta: தொழில்நுட்ப அடுக்கு

# techDescription
source: Built with Flutter framework using the gen-l10n code generation tool. Localization strings are managed through ARB (Application Resource Bundle) files, which provide a standardized format for managing translations. The system supports compile-time localization with type-safe access to localized strings through generated code.
si: gen-l10n කේත උත්පාදන මෙවලම භාවිතා කරමින් Flutter රාමුව සමඟ ගොඩනගා ඇත. ස්ථානීකරණ නූල් ARB (Application Resource Bundle) ගොනු හරහා කළමනාකරණය කරනු ලබන අතර, එය පරිවර්තන කළමනාකරණය සඳහා සම්මත ආකෘතියක් සපයයි. පද්ධතිය උත්පාදනය කරන ලද කේත හරහා වර්ග-ආරක්ෂිත ප්‍රවේශයක් සහිත සම්පාදන-කාලීන ස්ථානීකරණය සහාය දක්වයි.
ta: gen-l10n குறியீடு உருவாக்க கருவியைப் பயன்படுத்தி Flutter கட்டமைப்புடன் கட்டப்பட்டது. மொழியாக்க சரங்கள் ARB (Application Resource Bundle) கோப்புகள் மூலம் நிர்வகிக்கப்படுகின்றன, இது மொழிபெயர்ப்புகளை நிர்வகிக்க ஒரு தரப்படுத்தப்பட்ட வடிவத்தை வழங்குகிறது. இந்த அமைப்பு உருவாக்கப்பட்ட குறியீடு மூலம் வகை-பாதுகாப்பான அணுகலுடன் தொகுப்பு-நேர மொழியாக்கத்தை ஆதரிக்கிறது.

# flutterSdkDescription
source: Latest stable version with Material 3 design
si: Material 3 නිර්මාණය සහිත නවතම ස්ථාවර අනුවාදය
ta: Material 3 வடிவமைப்புடன் சமீபத்திய நிலையான பதிப்பு

source: Key Features
si: ප්‍රධාන විශේෂාංග
ta: முக்கிய அம்சங்கள்

source: Multi-language Support
si: බහු-භාෂා සහාය
ta: பல-மொழி ஆதரவு

# multiLanguageDescription
source: Full support for English, Sinhala, and Tamil languages with comprehensive string coverage
si: සවිස්තරාත්මක නූල් ආවරණයක් සහිත ඉංග්‍රීසි, සිංහල සහ දමිළ භාෂා සඳහා සම්පූර්ණ සහාය
ta: விரிவான சரம் உள்ளடக்கத்துடன் ஆங்கிலம், සිංහල மற்றும் தமிழ் மொழிகளுக்கு முழு ஆதரவு

source: Type-Safe Localization
si: වර්ග-ආරක්ෂිත ස්ථානීකරණය
ta: வகை-பாதுகாப்பான மொழியாக்கம்

# typeSafeDescription
source: Compile-time type checking ensures error-free localization access
si: සම්පාදන-කාලීන වර්ග පරීක්ෂාව දෝෂ-නිදහස් ස්ථානීකරණ ප්‍රවේශය සහතික කරයි
ta: தொகுப்பு-நேர வகை சரிபார்ப்பு பிழை-இல்லாத மொழியாக்க அணுகலை உறுதி செய்கிறது

source: Runtime Language Switching
si: ධාවන-කාලීන භාෂා මාරුව
ta: இயக்க நேர மொழி மாற்றம்

# runtimeSwitchingDescription
source: Seamless language switching without app restart
si: යෙදුම නැවත ආරම්භ නොකර අඛණ්ඩ භාෂා මාරුව
ta: பயன்பாட்டை மீண்டும் தொடங்காமல் மென்மையான மொழி மாற்றம்

source: Comprehensive Coverage
si: සවිස්තරාත්මක ආවරණය
ta: விரிவான உள்ளடக்கம்

# coverageDescription
source: All UI elements and content are fully localized
si: සියලුම UI මූලද්‍රව්‍ය සහ අන්තර්ගත සම්පූර්ණයෙන් ස්ථානීකරණය කර ඇත
ta: அனைத்து UI கூறுகள் மற்றும் உள்ளடக்கமும் முழுமையாக மொழியாக்கப்பட்டுள்ளன

source: Performance Optimized
si: කාර්ය සාධනය ප්‍රශස්ත කරන ලද
ta: செயல்திறன் மேம்படுத்தப்பட்டது

# performanceDescription
source: Efficient localization system with minimal overhead
si: අවම අතිරේක පිරිවැයක් සහිත කාර්යක්ෂම ස්ථානීකරණ පද්ධතිය
ta: குறைந்தபட்ச overhead உடன் திறமையான மொழியாக்க அமைப்பு

source: Contact Information
si: සම්බන්ධතා තොරතුරු
ta: தொடர்பு தகவல்

source: Email
si: විද්‍යුත් තැපෑල
ta: மின்னஞ்சல்

source: Website
si: වෙබ් අඩවිය
ta: வலைத்தளம்

source: GitHub Repository
si: GitHub ගබඩාව
ta: GitHub களஞ்சியம்

# emailCopied
source: Email address copied to clipboard
si: විද්‍යුත් තැපැල් ලිපිනය පසුරු පුවරුවට පිටපත් කරන ලදී
ta: மின்னஞ்சல் முகவரி கிளிப்போர்டுக்கு நகலெடுக்கப்பட்டது

# copyright
source: © 2026 Research Project. All rights reserved.
si: © 2026 පර්යේෂණ ව්‍යාපෘතිය. සියලුම හිමිකම් ඇවිරිණි.
ta: © 2026 ஆராய்ச்சி திட்டம். அனைத்து உரிமைகளும் பாதுகாக்கப்பட்டுள்ளன.

# premiumProductDescription
source: This premium product features exceptional quality and craftsmanship. Designed with attention to detail, it offers outstanding performance and durability. Perfect for both professional and personal use, this item represents the perfect balance between functionality and style.
si: මෙම වාරික නිෂ්පාදනය විශිෂ්ට ගුණාත්මකභාවය සහ ශිල්ප කුසලතාවයකින් යුක්තය. විස්තරයට අවධානය යොමු කරමින් නිර්මාණය කරන ලද, එය විශිෂ්ට කාර්ය සාධනය සහ ස්ථායිතාවයක් ලබා දෙයි. වෘත්තීය සහ පුද්ගලික භාවිතය සඳහා පරිපූර්ණ, මෙම අයිතමය ක්‍රියාකාරීත්වය සහ ශෛලිය අතර පරිපූර්ණ සමතුලිතතාවය නියෝජනය කරයි.
ta: இந்த பிரீமியம் தயாரிப்பு விதிவிலக்கான தரம் மற்றும் கைவினைத்திறனைக் கொண்டுள்ளது. விவரங்களுக்கு கவனம் செலுத்தி வடிவமைக்கப்பட்ட, இது சிறந்த செயல்திறன் மற்றும் நீடித்த தன்மையை வழங்குகிறது. தொழில்முறை மற்றும் தனிப்பட்ட பயன்பாட்டிற்கு சிறந்தது, இந்த உருப்படி செயல்பாட்டு மற்றும் பாணிக்கு இடையே சிறந்த சமநிலையைக் குறிக்கிறது.

# item
source: Item {number}
si: අයිතම {number}
ta: பொருள் {number}

# premiumQualityDescription
source: Premium quality {category} item with exceptional features. This product offers outstanding value and performance. Perfect for everyday use and designed to meet your highest expectations.
si: විශිෂ්ට විශේෂාංග සහිත වාරික ගුණාත්මක {category} අයිතමයක්. මෙම නිෂ්පාදනය විශිෂ්ට වටිනාකමක් සහ කාර්ය සාධනයක් ලබා දෙයි. දෛනික භාවිතය සඳහා පරිපූර්ණ සහ ඔබගේ ඉහළම අපේක්ෂාවන් සපුරාලීම සඳහා නිර්මාණය කරන ලද.
ta: விதிவிலக்கான அம்சங்களுடன் பிரீமியம் தர {category} பொருள். இந்த தயாரிப்பு சிறந்த மதிப்பு மற்றும் செயல்திறனை வழங்குகிறது. அன்றாட பயன்பாட்டிற்கு சிறந்தது மற்றும் உங்கள் உயர்ந்த எதிர்பார்ப்புகளை பூர்த்தி செய்ய வடிவமைக்கப்பட்டது.
